app/controllers/events_controller.rb

  def index
    @events = Event.where(:user_id => current_user.id)
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = 1

  def show
    @event = Event.find(params[:id])

    @workout = Workout.where (:event_id => @event.id ).first
---
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
SELECT "workouts".* FROM "workouts" WHERE "workouts"."event_id" = 1 LIMIT 1

  def create
    @event = Event.new(params[:event])
    @event.user_id = current_user.id
    @start_date = @event.starts_at
    @start_date = DateTime.civil(@start_date.year, @start_date.month, @start_date.day + 1, 1, 1, 1)
    @end_date = DateTime.civil(@start_date.year, @start_date.month, @start_date.day, 1, 1, 2)
    @event.ends_at = @end_date
    @event.all_day = true
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("description", "user_id", "starts_at", "rounds", "all_day", "updated_at", "created_at", "weight", "title", "ends_at") VALUES ('', 1, '2011-05-31 00:32:00.000000', NULL, 't', '2011-05-31 00:32:44.883146', '2011-05-31 00:32:44.883146', 200, 'Crossfit Outlier Sacramento', '2011-05-31 00:33:00.000000')