app/controllers/users_controller.rb

INSERT INTO "users" ("password", "encrypted_password", "email", "name", "updated_at", "created_at", "salt") VALUES (NULL, '79cb213c982a2b19025ae4e95aec2996461c39817937f82e705f319b265c43d7', 'wjdhollow@gmail.com', 'William Holloway', '2011-05-31 00:31:17.428053', '2011-05-31 00:31:17.428053', '40a74ff43526c4b32b05cba10f19358745e9036895e0fdd88d0a598e2515e496')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save